import { Component, OnInit, OnDestroy } from "@angular/core";
import { Injectable } from "@angular/core";
import { AppSettings } from '../../app.settings';
import { Http, Headers, RequestOptions} from '@angular/http';
import { NgRedux, select } from 'ng2-redux';
import { IAppState } from '../../store/store';
import { Router, ActivatedRoute, Params} from '@angular/router';
import { BehaviorSubject, Subscription } from 'rxjs/Rx';
import { ILoginInfo } from '../../store/logininfo/logininfo.types';
import { LOGININFO_INITIAL_STATE } from '../../store/logininfo/logininfo.initial-state';
import { LoginInfoActions } from '../../actions/logininfo.actions';

import {
    FormBuilder,
    FormGroup,
    FormControl,
    FormArray,
    Validators,
} from '@angular/forms';

@Component({
    selector: 'intro-statement',
    template: `

    <div id="disclaimerNotice" (onHidden)="onHidden()" class="modal fade" tabindex="-1" role="dialog" aria-hidden="true">
      <div class="modal-dialog modal-lg">
        <div class="modal-content">
          <div class="modal-header {{modalHeader | async}}" >
              <h3 class="modal-title pull-left"><i class="fa fa-check-square-o"></i>&nbsp;&nbsp;{{ modalTitle | async }}</h3>
            <button type="button" class="close pull-right" aria-label="Close" (click)="hideModal()">
              <span aria-hidden="true"><i class="fa fa-times"></i></span>
            </button>
          </div>
          <div class="modal-body">
              <p>{{ modalText | async }}</p>
          </div>
          <div class="modal-footer">
            <button type="button" class="btn btn-default pull-left" data-dismiss="modal">Κλείσιμο</button>
          </div>
        </div>
      </div>
    </div>

    <div *ngIf="(loginInfo$ | async).size !== 0">

    <p align="left"><strong></strong><strong>Όροι και Προϋποθέσεις Συμμετοχής στην Ηλεκτρονική Υπηρεσία</strong></p>
    <p align="left"><strong></strong>1. Η Ηλεκτρονική Υπηρεσία «Απέλλα» για την εκλογή, εξέλιξη, μονιμοποίηση και ανανέωση θητείας των καθηγητών Πανεπιστημίων και Τ.Ε.Ι. (Α.Ε.Ι.) παρέχεται από το Υπουργείο Παιδείας, Έρευνας και Θρησκευμάτων με την τεχνική υποστήριξη του Εθνικού Δικτύου Έρευνας και Τεχνολογίας Α.Ε. (εφεξής ΕΔΕΤ Α.Ε.). Αντικείμενο και σκοπός της υπηρεσίας είναι η ολοκληρωμένη διαχείριση των διαδικασιών εκλογής, εξέλιξης, μονιμοποίησης και ανανέωσης θητείας καθηγητών Α.Ε.Ι. καθώς και η κατάρτιση και τήρηση των μητρώων εσωτερικών και εξωτερικών μελών των Α.Ε.Ι., σύμφωνα και με την ισχύουσα νομοθεσία.</p>
    <p align="left">2. Η συμμετοχή κάθε υποψηφίου/εν ενεργεία καθηγητή στην «Απέλλα» και η υποβολή υποψηφιότητας από μέρους του, για την πλήρωση θέσης εκλογής/εξέλιξης/μονιμοποίησης/ανανέωσης θητείας, συνεπάγεται την αυτόματη αποδοχή των παρόντων όρων συμμετοχής, οι οποίοι προκύπτουν από το ισχύον θεσμικό πλαίσιο.</p>
    <p align="left">3. Ως συμμετέχοντες στην Ηλεκτρονική Υπηρεσία «Απέλλα» νοούνται, πέραν του υποψηφίου για την πλήρωση θέσης εκλογής/εξέλιξης/μονιμοποίησης/ανανέωσης θητείας, ο Υπεύθυνος Ιδρύματος που ορίζεται με απόφαση του Πρύτανη/Προέδρου Τ.Ε.Ι. και ανήκει στο διοικητικό προσωπικό του Α.Ε.Ι., οι αρμόδιοι διοικητικοί υπάλληλοι στους οποίους χορηγεί πρόσβαση ο Υπεύθυνος Ιδρύματος, και υποχρεωτικά το σύνολο των Καθηγητών πρώτης βαθμίδας και Αναπληρωτών και μόνιμων Επίκουρων Καθηγητών των Α.Ε.Ι. Δύνανται επιπλέον να συμμετέχουν οι Kαθηγητές πρώτης βαθμίδας και οι Αναπληρωτές και μόνιμοι Επίκουροι καθηγητές των ομοταγών Α.Ε.Ι. της αλλοδαπής, καθώς και οι ερευνητές ερευνητικών ιδρυμάτων της ημεδαπής και της αλλοδαπής αντίστοιχων βαθμίδων, οι οποίοι επιθυμούν να επιλεγούν ως εξωτερικά μέλη των μητρώων των Α.Ε.Ι. της ημεδαπής.</p>
    <p align="left">4. Η Ηλεκτρονική Υπηρεσία «Απέλλα» υλοποιεί διαδικασίες των Α.Ε.Ι., τα οποία φέρουν την αποκλειστική ευθύνη για τις λειτουργίες που επιτελούνται μέσω της εφαρμογής και συγκεκριμένα για όλα τα στάδια που συνθέτουν τη διαδικασία εκλογής/εξέλιξης/μονιμοποίησης/ανανέωσης θητείας των καθηγητών Α.Ε.Ι. Η ΕΔΕΤ Α.Ε., στο πλαίσιο της ως άνω διαδικασίας, εκτελεί χρέη τεχνικής υποστήριξης, ικανοποιώντας τα αιτήματα που λαμβάνει από τον εκάστοτε Υπεύθυνο Ιδρύματος καθώς και από τους νόμιμους εκπροσώπους των Α.Ε.Ι., χωρίς να φέρει ουδεμία ευθύνη για το περιεχόμενό τους. Το Υπουργείο Παιδείας, Έρευνας και Θρησκευμάτων, μέσω της πρόσβασης (λογαριασμός χρήστη) που διαθέτει στην Ηλεκτρονική Υπηρεσία «Απέλλα», εποπτεύει το σύνολο της διαδικασίας.</p>
    <p align="left">5. Κάθε συμμετέχων στην «Απέλλα» αποδέχεται ρητά ότι όλα τα στοιχεία που δηλώνει στην ηλεκτρονική υπηρεσία είναι ορθά, αληθή και σε ισχύ και ότι κάθε δήλωσή του στο πληροφοριακό σύστημα επέχει θέση Υπεύθυνης Δήλωσης, κατά την έννοια και με τις συνέπειες του ν.1599/1986, όπως ισχύει. Ειδικότερα, ο συμμετέχων στην «Απέλλα», ο οποίος θα επιλεγεί ως ο καταλληλότερος υποψήφιος για την πλήρωση θέσης εκλογής/εξέλιξης/μονιμοποίησης/ανανέωσης θητείας, οφείλει να προσκομίσει σε έντυπη μορφή όλα τα πρωτότυπα απαιτούμενα δικαιολογητικά οποιαδήποτε στιγμή του ζητηθούν για το σχετικό έλεγχο νομιμότητας, σύμφωνα με το ισχύον θεσμικό πλαίσιο.</p>
    <p align="left">6. Με τη συμμετοχή του στην Ηλεκτρονική Υπηρεσία «Απέλλα» και την αποδοχή των συγκεκριμένων όρων, ο χρήστης της υπηρεσίας δηλώνει υπεύθυνα ότι αποδέχεται τη χρήση και επεξεργασία των  προσωπικών του δεδομένων προς το σκοπό της πλήρωσης μιας προκηρυχθείσας θέσης εκλογής/εξέλιξης/μονιμοποίησης/ανανέωσης θητείας. Τα δεδομένα του χρήστη συλλέγονται και γίνεται η κατάλληλη επεξεργασία τους για τους σκοπούς της παροχής της υπηρεσίας, για την επικοινωνία μαζί του και για την ενημέρωσή του για ζητήματα που σχετίζονται με την υπηρεσία αυτή. Η συλλογή και επεξεργασία των δεδομένων προσωπικού χαρακτήρα που υποβάλλει ο χρήστης με τη ρητή συγκατάθεσή του κατά τη δημιουργία ή/και επικαιροποίηση του ατομικού του λογαριασμού στην «Απέλλα», υπόκειται στους όρους του παρόντος και κυρίως στους κανόνες του εθνικού, ευρωπαϊκού και διεθνούς δικαίου και ιδιαίτερα των διατάξεων του ν. 2472/1997 για την προστασία του ατόμου από την επεξεργασία δεδομένων προσωπικού χαρακτήρα, όπως κάθε φορά ισχύει. Ο χρήστης αποδέχεται επίσης ρητά ότι τα δεδομένα αυτά δύναται να κοινοποιηθούν στο πλαίσιο των ως άνω στα οικεία Α.Ε.Ι. Η ΕΔΕΤ Α.Ε. τηρεί το απόρρητο των δεδομένων προσωπικού χαρακτήρα που υποβάλλει ο συμμετέχων στην υπηρεσία και τα επεξεργάζεται, για λογαριασμό του Υπουργείου Παιδείας, Έρευνας και Θρησκευμάτων, χωρίς όμως να τα διαβιβάζει σε τρίτους με εξαίρεση τα προβλεπόμενα στο παρόν. H ΕΔΕΤ Α.Ε. λαμβάνει τα κατάλληλα οργανωτικά και τεχνικά μέτρα για την ασφάλεια των δεδομένων και την προστασία τους από τυχαία ή αθέμιτη καταστροφή, τυχαία απώλεια, αλλοίωση, απαγορευμένη διάδοση ή πρόσβαση και κάθε άλλη μορφή αθέμιτης επεξεργασίας, δεν εγγυάται όμως σε καμία περίπτωση ότι κάτι τέτοιο δε θα συμβεί και δε φέρει καμία ευθύνη σε περίπτωση που συμβεί. Επιπλέον η ΕΔΕΤ Α.Ε. έχει γνωστοποιήσει, σύμφωνα με το νόμο, στην Αρχή Προστασίας Δεδομένων Προσωπικού Χαρακτήρα την επεξεργασία των απλών προσωπικών δεδομένων που υποβάλλει κάθε κατηγορία χρήστη της υπηρεσίας με τη συγκατάθεσή του.</p>
    <p align="left">Σε καμία περίπτωση η ΕΔΕΤ Α.Ε. δεν μπορεί να θεωρηθεί υπόλογη ή/και υπεύθυνη για απώλεια δεδομένων και περιεχομένου που διακινείται μέσω της υπηρεσίας καθώς και για κάθε σχετική ζημία. Επίσης, η ΕΔΕΤ Α.Ε. δεν εγγυάται, ούτε φέρει καμία ευθύνη, για την ακρίβεια δεδομένων και περιεχομένου που είναι διαθέσιμα μέσω της υπηρεσίας.</p>
    <p align="left">Κάθε συμμετέχων έχει το δικαίωμα να πληροφορείται ή να λαμβάνει ενημέρωση σχετικά με τα τηρούμενα προσωπικά του δεδομένα. Αν ο χρήστης της υπηρεσίας επιθυμεί πληροφορίες σχετικά με τα προσωπικά του στοιχεία, τη χρήση τους ή αν επιθυμεί να διορθωθούν/επικαιροποιηθούν, μπορεί να απευθυνθεί στo <a href="https://apella.minedu.gov.gr/contact">Γραφείο Αρωγής Χρηστών</a>.</p>
    <p align="left">7. Η δυνατότητα πρόσβασης στα στοιχεία/προσωπικά δεδομένα που περιέρχονται σε γνώση των χρηστών, μέσω της συμμετοχής τους στην «Απέλλα», συνοδεύεται από τη ρητή υποχρέωση τους να χρησιμοποιούν τις σχετικές πληροφορίες αποκλειστικά και μόνο για προσωπική τους χρήση και σύμφωνα με τις διατάξεις περί προστασίας προσωπικών δεδομένων.</p>
    <p align="left">8. Η ΕΔΕΤ Α.Ε. λαμβάνει όλα τα απαραίτητα μέτρα ώστε να επιτύχει μέγιστη διαθεσιμότητα της υπηρεσίας, όμως σε καμία περίπτωση δεν παρέχει εγγυήσεις διαθεσιμότητας ούτε μπορεί να θεωρηθεί υπόλογη ή/και υπεύθυνη για κάθε πιθανή  ζημία  που οφείλεται σε απώλεια της υπηρεσίας για οποιοδήποτε χρονικό διάστημα.</p>
    <p align="left">9. Απαγορεύεται στους χρήστες να χρησιμοποιούν την Ηλεκτρονική Υπηρεσία «Απέλλα» για τη διακίνηση δεδομένων που εμπεριέχουν ή συνεπάγονται:</p>
    <ul><li>ψευδή δήλωση για την ταυτότητα του χρήστη/μέλους ή παραπλανητική δήλωση αναφορικά με τη σχέση ή/και συνεργασία του χρήστη/μέλους με κάποιο άλλο νομικό ή φυσικό πρόσωπο.</li>
    <li>παραχάραξη ή άλλη αλλοίωση των αναγνωριστικών των χρηστών/μελών με σκοπό την παραπλάνηση ως προς την προέλευση του περιεχομένου που μεταδίδεται μέσω της Ηλεκτρονικής Υπηρεσίας «Απέλλα».</li>
    <li>διαφημιστικά μηνύματα ή άλλου περιεχομένου προώθησης προϊόντων ή υπηρεσιών ή τρίτων δικτυακών τόπων, την αποστολή ανεπιθύμητων και μη προσκαλούμενων από τον λήπτη ηλεκτρονικών μηνυμάτων και οποιαδήποτε άλλη μορφή ανεπιθύμητης προώθησης περιεχομένου.</li>
    <li>ιούς ή οποιοδήποτε άλλο ηλεκτρονικό κώδικα, αρχεία ή προγράμματα σχεδιασμένα να παρεμβληθούν, καταστρέψουν ή περιορίσουν τη λειτουργία οποιουδήποτε λογισμικού ή εξοπλισμού ηλεκτρονικών υπολογιστών ή τηλεπικοινωνιακού δικτύου ή εξοπλισμού.</li>
    <li>παρεμβολή στις υπηρεσίες ή διάσπαση των υπηρεσιών ή των servers ή των δικτύων που είναι συνδεδεμένα με την Ηλεκτρονική Υπηρεσία «Απέλλα» ή μη συμμόρφωση με τους κανόνες, τις προϋποθέσεις, τις διαδικασίες και τους κανόνες των δικτύων αυτών.</li>
    <li>παραβίαση, με ή χωρίς πρόθεση, οποιασδήποτε τοπικής, εθνικής, ευρωπαϊκής, διεθνούς νομοθεσίας ή/και οποιουδήποτε κανόνα που έχει νομοθετική ισχύ και αφορά ή/και καλύπτει την Ηλεκτρονική Υπηρεσία «Απέλλα».</li>
    <li>παρενόχληση με οποιονδήποτε τρόπο της ιδιωτικής ζωής και των ατομικών και κοινωνικών δικαιωμάτων άλλων χρηστών/μελών αλλά και κάθε ατόμου.</li>
    </ul><p>10. Σε κάθε περίπτωση η ΕΔΕΤ Α.Ε. διατηρεί το δικαίωμα τροποποίησης των παρόντων όρων και προϋποθέσεων ενημερώνοντας με σχετική ανάρτηση στην παρούσα ιστοσελίδα  τους εγγεγραμμένους χρήστες/συμμετέχοντες στην υπηρεσία. Η συνέχιση της χρήσης της εφαρμογής συνεπάγεται αυτόματη και ρητή αποδοχή των τροποποιημένων όρων. Σε περίπτωση διαφωνίας με τους νέους όρους ο εκάστοτε χρήσης/συμμετέχων μπορεί να αιτηθεί, με γραπτό αίτημα στο <a href="https://apella.minedu.gov.gr/contact">Γραφείο Αρωγής Χρηστών</a> της υπηρεσίας, την απενεργοποίηση του λογαριασμού του στην παρούσα εφαρμογή.</p>
    <p align="left">11. Το Υπουργείο Παιδείας, Έρευνας και Θρησκευμάτων και η ΕΔΕΤ Α.Ε. δε φέρουν καμία απολύτως ευθύνη για όσα στοιχεία και πληροφορίες δηλώθηκαν υπεύθυνα είτε από τον Υπεύθυνο Ιδρύματος και τους λοιπούς αρμόδιους διοικητικούς υπαλλήλους των Α.Ε.Ι. κατά την ανάρτηση των στοιχείων μίας θέσης εκλογής/εξέλιξης/μονιμοποίησης/ανανέωσης θητείας είτε από τον υποψήφιο/εν ενεργεία καθηγητή κατά τη δημιουργία του ατομικού του λογαριασμού στην Ηλεκτρονική Υπηρεσία «Απέλλα» ή/και την ηλεκτρονική του υποβολή υποψηφιότητας.</p>
    <p>12. Οι παρόντες όροι συμμετοχής αντικαθιστούν κάθε προηγούμενη συνεννόηση προφορική ή γραπτή ή άλλο συμβόλαιο, σύμβαση, συμφωνητικό σχετικό με την Ηλεκτρονική Υπηρεσία «Απέλλα». Οι ως άνω όροι συμμετοχής διέπονται από το ελληνικό δίκαιο και κάθε διαφορά που θα δημιουργείται σε σχέση με αυτούς θα επιλύεται από τα δικαστήρια των Αθηνών.</p>
        <form [formGroup]="formGroup"  #form>
          <div class="row">
            <div class="col-md-1 ">
              <input type="checkbox" [checked]="disclaimerChecked | async"  formControlName="disclaimerChecked" >
            </div>
            <div class="col-md-9">
              <label for="disclaimerChecked">Συμφωνώ με τα παραπάνω</label>
            </div>
          </div>

         </form>
         <div class="row" style="margin-top: 20px; margin-bottom: 20px;">
             <div class="col-md-6">
                 <button type="button" class="btn-primary btn-lg pull-left" (click)="navigateBack()">
                     <i class="fa fa-backward"></i>
                 </button>
             </div>
             <div class="col-md-6">
                 <button type="button" class="btn-primary btn-lg pull-right isclickable" style="width: 9em;" (click)="saveStatementAgree()">
                     <span style="font-size: 0.9em; font-weight: bold;">Συνέχεια&nbsp;&nbsp;&nbsp;</span><i class="fa fa-forward"></i>
                 </button>
             </div>

         </div>


      </div>



   `
})

@Injectable() export default class Disclaimer implements OnInit, OnDestroy {

    public formGroup: FormGroup;
    loginInfo$: BehaviorSubject<ILoginInfo>;
    private modalTitle: BehaviorSubject<string>;
    private modalText: BehaviorSubject<string>;
    private modalHeader: BehaviorSubject<string>;
    private disclaimerChecked: BehaviorSubject<number>;
    loginInfoSub: Subscription;

    constructor(private fb: FormBuilder,
        private _ngRedux: NgRedux<IAppState>,
        private _lia: LoginInfoActions,
        private router: Router) {

          this.formGroup = this.fb.group({
              disclaimerChecked: ['', []],
          });

          this.loginInfo$ = new BehaviorSubject(LOGININFO_INITIAL_STATE);
          this.modalTitle =  new BehaviorSubject("");
          this.modalText =  new BehaviorSubject("");
          this.modalHeader =  new BehaviorSubject("");
          this.disclaimerChecked = new BehaviorSubject(0);

    }

    public showModal():void {
        (<any>$('#disclaimerNotice')).modal('show');
    }

    public hideModal():void {
        (<any>$('#disclaimerNotice')).modal('hide');
    }

    public onHidden():void {
        //this.isModalShown.next(false);
    }


    ngOnDestroy() {

      (<any>$('#disclaimerNotice')).remove();

      if (this.loginInfoSub)
        this.loginInfoSub.unsubscribe();

      if (this.loginInfo$)
        this.loginInfo$.unsubscribe();
    }

    ngOnInit() {

      (<any>$('#disclaimerNotice')).appendTo("body");

      this.loginInfoSub = this._ngRedux.select(state => {
          if (state.loginInfo.size > 0) {
              state.loginInfo.reduce(({}, loginInfoToken) => {
                  this.formGroup.controls['disclaimerChecked'].setValue(loginInfoToken.disclaimer_checked);
                  this.disclaimerChecked.next(loginInfoToken.disclaimer_checked);
                  return loginInfoToken;
              }, {});
          }
          return state.loginInfo;
      }).subscribe(this.loginInfo$);
  }

  navigateBack() {
      this.router.navigate(['/parent-form']);
  }

  saveStatementAgree() {
      if (!this.formGroup.controls['disclaimerChecked'].value) {
          this.modalHeader.next("modal-header-danger");
          this.modalTitle.next("Αποδοχή όρων χρήσης");
          this.modalText.next("Πρέπει να αποδεχθείτε πρώτα τους όρους χρήσης για να συνεχίσετε");
          this.showModal();
      } else {
          this._lia.saveStatementAgree(this.formGroup.controls['disclaimerChecked'].value);
          this.router.navigate(['epal-class-select']);
      }
  }
}
